Repository: feth/_noname
Catalog: namepoll/noname/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Brand is available
fr: La marque est disponible

source: .com is available
fr: Le .com est disponible

source: .fr is available
fr: Le .fr est disponible

source: .net is available
fr: Le .net est disponible

source: brand (INPI))
fr: marque (INPI)

source: .com TLD
fr: TLD .com

source: .fr TLD
fr: TLD .fr

source: .net TLD
fr: TLD .net

source: company name
fr: nom d'entreprise

source: company names
fr: noms d'entreprise

source: voter
fr: votant

source: voters
fr: votants

source: Valid
fr: Acceptable

source: Great
fr: Positif

source: What do you think this name would be to our company?
fr: Que pensez-vous que ce nom serait pour notre entreprise ?

source: evaluation
fr: évaluation

source: evaluations
fr: évaluations
